## Pandas

### Pandas - Series

In [7]:
import numpy as np

In [8]:
import pandas as pd

In [9]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b':20, 'c':30}

In [10]:
pd.Series(my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series([2,3,4,5])

0    2
1    3
2    4
3    5
dtype: int64

In [18]:
ser1 = pd.Series([1,2,3,4], ['Portugal', 'USA', 'Germany', 'UK'])

In [19]:
ser1

Portugal    1
USA         2
Germany     3
UK          4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,4,5], ['China', 'Italy', 'Brazil', 'Portugal'])

In [26]:
ser2

China       1
Italy       2
Brazil      4
Portugal    5
dtype: int64

In [27]:
ser1['Portugal']

1

In [28]:
ser1 + ser2

Brazil      NaN
China       NaN
Germany     NaN
Italy       NaN
Portugal    6.0
UK          NaN
USA         NaN
dtype: float64

### Pandas - Data Frames 1

In [29]:
from numpy.random import randn

In [30]:
np.random.seed(101) # make sure we get the same random numbers

In [33]:
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['w','x', 'y', 'z'])

In [34]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [40]:
df['w']

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

In [44]:
df.w

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

In [46]:
df[['w', 'z']]

          w         z
a  0.302665 -1.159119
b -0.134841  0.184502
c  0.807706  0.329646
d -0.497104  0.484752
e -0.116773  1.996652

In [48]:
df['new'] = df['w'] + df['y']

In [49]:
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119 -1.403420
b -0.134841  0.390528  0.166905  0.184502  0.032064
c  0.807706  0.072960  0.638787  0.329646  1.446493
d -0.497104 -0.754070 -0.943406  0.484752 -1.440510
e -0.116773  1.901755  0.238127  1.996652  0.121354

In [51]:
df.drop('new', axis = 1)

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [53]:
df = df.drop('new', axis=1)

In [54]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [56]:
df.drop('w', axis=1, inplace=True)

In [58]:
df.drop('e')

          x         y         z
a  1.693723 -1.706086 -1.159119
b  0.390528  0.166905  0.184502
c  0.072960  0.638787  0.329646
d -0.754070 -0.943406  0.484752

In [59]:
df.shape

(5, 3)

In [60]:
df

          x         y         z
a  1.693723 -1.706086 -1.159119
b  0.390528  0.166905  0.184502
c  0.072960  0.638787  0.329646
d -0.754070 -0.943406  0.484752
e  1.901755  0.238127  1.996652

In [62]:
df.loc['a']

x    1.693723
y   -1.706086
z   -1.159119
Name: a, dtype: float64

df.iloc[1]

In [67]:
df.loc['a', 'z']

-1.1591194155484297

In [74]:
df.loc[['a', 'b'], ['y','z']]

          y         z
a -1.706086 -1.159119
b  0.166905  0.184502

In [75]:
df['test'] = df['y'] * df['z']

In [76]:
df['test']

a    1.977557
b    0.030794
c    0.210574
d   -0.457318
e    0.475457
Name: test, dtype: float64

In [77]:
df

          x         y         z      test
a  1.693723 -1.706086 -1.159119  1.977557
b  0.390528  0.166905  0.184502  0.030794
c  0.072960  0.638787  0.329646  0.210574
d -0.754070 -0.943406  0.484752 -0.457318
e  1.901755  0.238127  1.996652  0.475457

In [80]:
df[:2]

          x         y         z      test
a  1.693723 -1.706086 -1.159119  1.977557
b  0.390528  0.166905  0.184502  0.030794

### Pandas - Data Frames 2

In [81]:
new_df = pd.DataFrame(randn(5, 4), ['Manso', 'Afonso', 'António', 'Kiko', 'Aguiar'], ['A', 'B', 'C', 'D'])

In [82]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [83]:
new_df > 0

             A      B      C      D
Manso    False   True  False   True
Afonso    True  False  False   True
António   True  False  False  False
Kiko      True  False   True   True
Aguiar   False   True  False   True

In [84]:
new_df[new_df > 0]

                A         B         C         D
Manso         NaN  0.196800       NaN  0.000366
Afonso   1.025984       NaN       NaN  0.649826
António  2.154846       NaN       NaN       NaN
Kiko     0.147027       NaN  0.558769  1.024810
Aguiar        NaN  1.862864       NaN  0.610478

In [90]:
new_df[new_df['A']>0]

                A         B         C         D
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810

In [93]:
new_df[new_df['D']<0]

                A         B         C         D
António  2.154846 -0.610259 -0.755325 -0.346419

In [96]:
new_df[new_df['B'] > 0][['A', 'B']]

               A         B
Manso  -0.993263  0.196800
Aguiar -0.925874  1.862864

In [101]:
boolseries = new_df['A'] > 0

In [102]:
boolseries

Manso      False
Afonso      True
António     True
Kiko        True
Aguiar     False
Name: A, dtype: bool

In [107]:
result = new_df[boolseries][['A', 'B']]

In [108]:
result

                A         B
Afonso   1.025984 -0.156598
António  2.154846 -0.610259
Kiko     0.147027 -0.479448

In [109]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [122]:
new_df[(new_df['B']> 0) & (new_df['A'] > 0)]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [123]:
new_df[(new_df['B']> 0) | (new_df['A'] > 0)]

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [124]:
new_df.reset_index()

     index         A         B         C         D
0    Manso -0.993263  0.196800 -1.136645  0.000366
1   Afonso  1.025984 -0.156598 -0.031579  0.649826
2  António  2.154846 -0.610259 -0.755325 -0.346419
3     Kiko  0.147027 -0.479448  0.558769  1.024810
4   Aguiar -0.925874  1.862864 -1.133817  0.610478

In [125]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [133]:
new_index = 'PT DE UK USA DEN'.split()

In [134]:
new_index

['PT', 'DE', 'UK', 'USA', 'DEN']

In [135]:
new_df['States'] = new_index

In [136]:
new_df

                A         B         C         D States
Manso   -0.993263  0.196800 -1.136645  0.000366     PT
Afonso   1.025984 -0.156598 -0.031579  0.649826     DE
António  2.154846 -0.610259 -0.755325 -0.346419     UK
Kiko     0.147027 -0.479448  0.558769  1.024810    USA
Aguiar  -0.925874  1.862864 -1.133817  0.610478    DEN

In [138]:
new_df.set_index('States')

               A         B         C         D
States
PT     -0.993263  0.196800 -1.136645  0.000366
DE      1.025984 -0.156598 -0.031579  0.649826
UK      2.154846 -0.610259 -0.755325 -0.346419
USA     0.147027 -0.479448  0.558769  1.024810
DEN    -0.925874  1.862864 -1.133817  0.610478

### Pandas - Data Frames 3

In [140]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [141]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [142]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [145]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [147]:
df.index.names = ['Groups', 'Num']

In [149]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [153]:
df.loc['G2'].loc[2]['B']

-0.7417897046689249

In [156]:
df.xs(1, level='Num')

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932